# Быстрая сортировка (quick sort)

### Постановка задачи

Дан неотсортированный массив состоящий из `n` элементов. Написать функцию для сортировки массива

### Подход:

- Выберите в качестве опорного элемента самый правый элемент массива
- Разделите массив, используя опорный элемент(например, все элементы, значения который меньше опорного переместить в левую сторону от опорного)
- Рекурсивно примените алгоритм к левой части массива(без старого опорного значения), а за тем к правой(включая опорное значение)

### Временная сложность

- В худшем случае: O(n^2)
- В лучшем случае: O(n log n)
- Средняя производительность: O(n log n)

### Пространственная сложность

- В худшем случае: O(n log n)

### Имя создателя алгоритма и дата создания

Тони Хоар, 1959

### Пример

```
arr[] = {10, 80, 30, 90, 40, 50, 70}
Индексы:  0   1   2   3   4   5   6

Младший индекс(low) = 0, старший индекс(high) = 6
Выбираем значение high элемента в качестве опорного:
pivot = arr[h] = 70

Инициализируем индекс самого малого значения элемента, i = -1

Перемещаем элементы от j = младшего, до старшего - 1
j = 0 : Так как arr[j] <= pivot увеличиваем i на единицу (i++) и меняем местами arr[i] с arr[j]
i = 0
arr[] = {10, 80, 30, 90, 40, 50, 70} // Нет изменений, так как i и j одинаковы

j = 1 : Так как arr[j] > опорного значения(pivot) ничего не делаем
// Нет изменений в i и arr[]

j = 2 : Так как arr[j] <= pivot увеличиваем i на единицу (i++) и меняем местами arr[i] с arr[j]
i = 1
arr[] = {10, 30, 80, 90, 40, 50, 70} // 80 и 30 поменялись местами

j = 3 : Так как arr[j] > опорного значения(pivot) ничего не делаем
// Нет изменений в i и arr[]

j = 4 : Так как arr[j] <= pivot увеличиваем i на единицу (i++) и меняем местами arr[i] с arr[j]
i = 2
arr[] = {10, 30, 80, 90, 40, 50, 70} // 80 и 40 поменялись местами

j = 5 : Так как arr[j] <= pivot увеличиваем i на единицу (i++) и меняем местами arr[i] с arr[j]
i = 3
arr[] = {10, 30, 40, 50, 80, 90, 70} // 90 и 50 поменялись местами

Мы выходим из петли так как j = high - 1
Теперь поставим наше опорное значение на его место:
arr[i+1] и arr[high]
arr[] = {10, 30, 40, 50, 70, 90, 80} // 80 и 70 поменялись местами

Теперь элементы на своих местах. Все элементы, 
что больше 70, стоят после него, а все, что меньше - после
```
### Полезные ссылки:
- https://ru.wikipedia.org/wiki/быстрая_сортировка - статья с википедии, посвященная quick sort
- https://habr.com/ru/articles/689738/ - статья на хабре, посвященная различным алгоритмам сортировки и их сравнению
